src/Configuration/DataProcessors/МониторРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторРуководителя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Configuration/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Configuration/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Configuration/DataProcessors/МониторРуководителя/Ext/ManagerModule.bsl
Функция ПолучитьДанныеДляДиаграмм(ПериодОбработки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ПродажиОбороты.Клиент.Источник.Представление, ""не указан"") КАК ИсточникиИнформации,
		|	ПродажиОбороты.СуммаОборот КАК Количество
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ПродажиОбороты.Клиент.Источник.Представление, ""не указан""),
		|	ПродажиОбороты.СуммаОборот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
		|	ПродажиОбороты.Сотрудник.Представление КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.СуммаОборот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Сотрудник.Представление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
		|ПОМЕСТИТЬ ВТ_КонкретныеУслуги
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
		|ПОМЕСТИТЬ ВТ_ВсеПродажи
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ПродажиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КонкретныеУслуги.Номенклатура КАК Номенклатура,
		|	ВТ_КонкретныеУслуги.СуммаОборот КАК СуммаПродажНоменклатуры,
		|	ВТ_ВсеПродажи.СуммаОборот КАК ОбщаяСуммаПоУслугам
		|ПОМЕСТИТЬ ВТ_Предытог
		|ИЗ
		|	ВТ_КонкретныеУслуги КАК ВТ_КонкретныеУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеПродажи КАК ВТ_ВсеПродажи
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
		|			ТОГДА ВТ_Предытог.Номенклатура.Представление
		|		ИНАЧЕ ""Прочее""
		|	КОНЕЦ КАК Номенклатура,
		|	СУММА(ВТ_Предытог.СуммаПродажНоменклатуры) КАК Сумма
		|ИЗ
		|	ВТ_Предытог КАК ВТ_Предытог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
		|			ТОГДА ВТ_Предытог.Номенклатура.Представление
		|		ИНАЧЕ ""Прочее""
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодОбработки);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодОбработки));
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	Возврат РезультатПакет;           
	
КонецФункции
